<script lang="ts">
	import H3 from './H3.svelte';
</script>

<section class="py-16 bg-gray-800 text-white" id="open-source">
	<div class="max-w-5xl px-4 md:px-10 lg:px-20 mx-auto">
		<H3 text="开源项目" />
		<p class="text-center mt-4">
			<strong class="font-bold underline underline-offset-4">像素丢失</strong
			>建立在已有的开源项目之上，在此鸣谢以下优秀的项目和贡献者！
		</p>

		<div class="flex items-center justify-center flex-wrap gap-4 mt-10">
			<a
				class="border border-white flex items-center gap-3 rounded p-2"
				href="https://github.com/lovell/sharp"
				target="_blank"
				rel="noreferrer"
			>
				<svg class="w-6 h-6" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg" fill="none"
					><path
						fill="#fff"
						fill-rule="evenodd"
						d="M8 1C4.133 1 1 4.13 1 7.993c0 3.09 2.006 5.71 4.787 6.635.35.064.478-.152.478-.337 0-.166-.006-.606-.01-1.19-1.947.423-2.357-.937-2.357-.937-.319-.808-.778-1.023-.778-1.023-.635-.434.048-.425.048-.425.703.05 1.073.72 1.073.72.624 1.07 1.638.76 2.037.582.063-.452.244-.76.444-.935-1.554-.176-3.188-.776-3.188-3.456 0-.763.273-1.388.72-1.876-.072-.177-.312-.888.07-1.85 0 0 .586-.189 1.924.716A6.711 6.711 0 018 4.381c.595.003 1.194.08 1.753.236 1.336-.905 1.923-.717 1.923-.717.382.963.142 1.674.07 1.85.448.49.72 1.114.72 1.877 0 2.686-1.638 3.278-3.197 3.45.251.216.475.643.475 1.296 0 .934-.009 1.688-.009 1.918 0 .187.127.404.482.336A6.996 6.996 0 0015 7.993 6.997 6.997 0 008 1z"
						clip-rule="evenodd"
					/>
				</svg>
				lovell/sharp
			</a>

			<a
				class="border border-white flex items-center gap-3 rounded p-2"
				href="https://github.com/lucide-icons/lucide"
				target="_blank"
				rel="noreferrer"
			>
				<svg class="w-6 h-6" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg" fill="none">
					<path
						fill="#fff"
						fill-rule="evenodd"
						d="M8 1C4.133 1 1 4.13 1 7.993c0 3.09 2.006 5.71 4.787 6.635.35.064.478-.152.478-.337 0-.166-.006-.606-.01-1.19-1.947.423-2.357-.937-2.357-.937-.319-.808-.778-1.023-.778-1.023-.635-.434.048-.425.048-.425.703.05 1.073.72 1.073.72.624 1.07 1.638.76 2.037.582.063-.452.244-.76.444-.935-1.554-.176-3.188-.776-3.188-3.456 0-.763.273-1.388.72-1.876-.072-.177-.312-.888.07-1.85 0 0 .586-.189 1.924.716A6.711 6.711 0 018 4.381c.595.003 1.194.08 1.753.236 1.336-.905 1.923-.717 1.923-.717.382.963.142 1.674.07 1.85.448.49.72 1.114.72 1.877 0 2.686-1.638 3.278-3.197 3.45.251.216.475.643.475 1.296 0 .934-.009 1.688-.009 1.918 0 .187.127.404.482.336A6.996 6.996 0 0015 7.993 6.997 6.997 0 008 1z"
						clip-rule="evenodd"
					/>
				</svg>
				lucide-icons/lucide
			</a>

			<a
				class="border border-white flex items-center gap-3 rounded p-2"
				href="https://github.com/supercharge/fs"
				target="_blank"
				rel="noreferrer"
			>
				<svg class="w-6 h-6" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg" fill="none">
					<path
						fill="#fff"
						fill-rule="evenodd"
						d="M8 1C4.133 1 1 4.13 1 7.993c0 3.09 2.006 5.71 4.787 6.635.35.064.478-.152.478-.337 0-.166-.006-.606-.01-1.19-1.947.423-2.357-.937-2.357-.937-.319-.808-.778-1.023-.778-1.023-.635-.434.048-.425.048-.425.703.05 1.073.72 1.073.72.624 1.07 1.638.76 2.037.582.063-.452.244-.76.444-.935-1.554-.176-3.188-.776-3.188-3.456 0-.763.273-1.388.72-1.876-.072-.177-.312-.888.07-1.85 0 0 .586-.189 1.924.716A6.711 6.711 0 018 4.381c.595.003 1.194.08 1.753.236 1.336-.905 1.923-.717 1.923-.717.382.963.142 1.674.07 1.85.448.49.72 1.114.72 1.877 0 2.686-1.638 3.278-3.197 3.45.251.216.475.643.475 1.296 0 .934-.009 1.688-.009 1.918 0 .187.127.404.482.336A6.996 6.996 0 0015 7.993 6.997 6.997 0 008 1z"
						clip-rule="evenodd"
					/>
				</svg>
				supercharge/fs
			</a>

			<a
				class="border border-white flex items-center gap-3 rounded p-2"
				href="https://github.com/electron-vite/electron-vite-react"
				target="_blank"
				rel="noreferrer"
			>
				<svg class="w-6 h-6" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg" fill="none">
					<path
						fill="#fff"
						fill-rule="evenodd"
						d="M8 1C4.133 1 1 4.13 1 7.993c0 3.09 2.006 5.71 4.787 6.635.35.064.478-.152.478-.337 0-.166-.006-.606-.01-1.19-1.947.423-2.357-.937-2.357-.937-.319-.808-.778-1.023-.778-1.023-.635-.434.048-.425.048-.425.703.05 1.073.72 1.073.72.624 1.07 1.638.76 2.037.582.063-.452.244-.76.444-.935-1.554-.176-3.188-.776-3.188-3.456 0-.763.273-1.388.72-1.876-.072-.177-.312-.888.07-1.85 0 0 .586-.189 1.924.716A6.711 6.711 0 018 4.381c.595.003 1.194.08 1.753.236 1.336-.905 1.923-.717 1.923-.717.382.963.142 1.674.07 1.85.448.49.72 1.114.72 1.877 0 2.686-1.638 3.278-3.197 3.45.251.216.475.643.475 1.296 0 .934-.009 1.688-.009 1.918 0 .187.127.404.482.336A6.996 6.996 0 0015 7.993 6.997 6.997 0 008 1z"
						clip-rule="evenodd"
					/>
				</svg>
				electron-vite/electron-vite-react
			</a>
		</div>

		<p class="text-center text-xs mt-10 text-zinc-400">
			你可以在此获取像素丢失的源代码：
			<a href="https://github.com/9t5c/pixel-loss" target="_blank" rel="noreferrer">🔗 GitHub</a>
			，建议和反馈请来信发送至 uucc@live.com，谢谢。
		</p>
	</div>
</section>
